app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "description", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "First"], ["description", "Description"], ["location", "Here"], ["created_at", "2018-10-14 23:48:50.564311"], ["updated_at", "2018-10-14 23:48:50.564311"]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "location" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["location", "There"], ["updated_at", "2018-10-15 09:37:22.707221"], ["id", 1]]