app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "taken", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "MyString"], ["taken", 0], ["event_id", 980190962], ["created_at", "2018-10-16 22:53:27.633645"], ["updated_at", "2018-10-16 22:53:27.633645"]]